In [1]:
import numpy as np
import pandas as pd

In [3]:
dict1={
    "name":["bibek","asmit","milan","kishor"],
    "marks":[23,67,45,56],
    "city":["dmk","ktm","pk","brt"]
}

In [4]:
df=pd.DataFrame(dict1)

In [5]:
df

     name  marks city
0   bibek     23  dmk
1   asmit     67  ktm
2   milan     45   pk
3  kishor     56  brt

In [7]:
df.to_csv('friends.csv')

In [9]:
df.to_csv('friends_index.csv',index=False)

In [10]:
pd.read_csv('friends.csv')

   Unnamed: 0    name  marks city
0           0   bibek     23  dmk
1           1   asmit     67  ktm
2           2   milan     45   pk
3           3  kishor     56  brt

In [15]:
dict1['marks']

[23, 67, 45, 56]

In [16]:
dict1['marks'][0]

23

In [17]:
dict1['marks'][0]=50

In [18]:
dict1

{'name': ['bibek', 'asmit', 'milan', 'kishor'],
 'marks': [50, 67, 45, 56],
 'city': ['dmk', 'ktm', 'pk', 'brt']}

In [19]:
dict1['city'][0]='kamal'

In [20]:
dict1

{'name': ['bibek', 'asmit', 'milan', 'kishor'],
 'marks': [50, 67, 45, 56],
 'city': ['kamal', 'ktm', 'pk', 'brt']}

In [27]:
pd.DataFrame(dict1)

     name  marks   city
0   bibek     50  kamal
1   asmit     67    ktm
2   milan     45     pk
3  kishor     56    brt

In [29]:
df.to_csv('changed.csv')

In [47]:
df.index=['1st','2nd','3rd','4th']

In [48]:
dict1

{'name': ['bibek', 'asmit', 'milan', 'kishor'],
 'marks': [50, 67, 45, 56],
 'city': ['kamal', 'ktm', 'pk', 'brt']}

In [49]:
pd.DataFrame(dict1)

     name  marks   city
0   bibek     50  kamal
1   asmit     67    ktm
2   milan     45     pk
3  kishor     56    brt

In [53]:
ser= pd.Series(np.random.rand(10))

In [58]:
ser.dtype

dtype('float64')

In [64]:
newdf=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [66]:
newdf

            0         1         2         3         4
0    0.373841  0.133593  0.827758  0.332850  0.815619
1    0.223381  0.673758  0.708266  0.918993  0.229196
2    0.735779  0.986118  0.126935  0.685023  0.050855
3    0.331808  0.607073  0.507821  0.953118  0.656889
4    0.433670  0.947273  0.162297  0.420103  0.655472
..        ...       ...       ...       ...       ...
329  0.942466  0.445416  0.966202  0.295537  0.293268
330  0.387183  0.186650  0.753521  0.025815  0.721198
331  0.445693  0.522044  0.357614  0.175042  0.052485
332  0.134392  0.838215  0.538764  0.339175  0.296753
333  0.875011  0.898489  0.911705  0.943656  0.416888

[334 rows x 5 columns]

In [67]:
type(newdf)

pandas.core.frame.DataFrame

In [68]:
newdf[0][0]="bibek"

In [70]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [71]:
newdf

            0         1         2         3         4
0       bibek  0.133593  0.827758  0.332850  0.815619
1    0.223381  0.673758  0.708266  0.918993  0.229196
2    0.735779  0.986118  0.126935  0.685023  0.050855
3    0.331808  0.607073  0.507821  0.953118  0.656889
4     0.43367  0.947273  0.162297  0.420103  0.655472
..        ...       ...       ...       ...       ...
329  0.942466  0.445416  0.966202  0.295537  0.293268
330  0.387183  0.186650  0.753521  0.025815  0.721198
331  0.445693  0.522044  0.357614  0.175042  0.052485
332  0.134392  0.838215  0.538764  0.339175  0.296753
333  0.875011  0.898489  0.911705  0.943656  0.416888

[334 rows x 5 columns]

In [72]:
newdf.head()

          0         1         2         3         4
0     bibek  0.133593  0.827758  0.332850  0.815619
1  0.223381  0.673758  0.708266  0.918993  0.229196
2  0.735779  0.986118  0.126935  0.685023  0.050855
3  0.331808  0.607073  0.507821  0.953118  0.656889
4   0.43367  0.947273  0.162297  0.420103  0.655472

In [74]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [76]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [77]:
newdf[0][0]=0.4

In [78]:
newdf

            0         1         2         3         4
0         0.4  0.133593  0.827758  0.332850  0.815619
1    0.223381  0.673758  0.708266  0.918993  0.229196
2    0.735779  0.986118  0.126935  0.685023  0.050855
3    0.331808  0.607073  0.507821  0.953118  0.656889
4     0.43367  0.947273  0.162297  0.420103  0.655472
..        ...       ...       ...       ...       ...
329  0.942466  0.445416  0.966202  0.295537  0.293268
330  0.387183  0.186650  0.753521  0.025815  0.721198
331  0.445693  0.522044  0.357614  0.175042  0.052485
332  0.134392  0.838215  0.538764  0.339175  0.296753
333  0.875011  0.898489  0.911705  0.943656  0.416888

[334 rows x 5 columns]

In [79]:
newdf[0]

0           0.4
1      0.223381
2      0.735779
3      0.331808
4       0.43367
         ...
329    0.942466
330    0.387183
331    0.445693
332    0.134392
333    0.875011
Name: 0, Length: 334, dtype: object

In [84]:
type(newdf[0])

pandas.core.series.Series

In [87]:
newdf2 = newdf

In [88]:
newdf2.head()

          0         1         2         3         4
0       0.4  0.133593  0.827758  0.332850  0.815619
1  0.223381  0.673758  0.708266  0.918993  0.229196
2  0.735779  0.986118  0.126935  0.685023  0.050855
3  0.331808  0.607073  0.507821  0.953118  0.656889
4   0.43367  0.947273  0.162297  0.420103  0.655472

In [89]:
newdf2[0][0]=54

In [91]:
newdf.head()

          0         1         2         3         4
0        54  0.133593  0.827758  0.332850  0.815619
1  0.223381  0.673758  0.708266  0.918993  0.229196
2  0.735779  0.986118  0.126935  0.685023  0.050855
3  0.331808  0.607073  0.507821  0.953118  0.656889
4   0.43367  0.947273  0.162297  0.420103  0.655472

In [102]:
newdf.loc[(newdf[0]<0.3) & (newdf[1]>0.3)].head()

           0         1         2         3         4
1   0.223381  0.673758  0.708266  0.918993  0.229196
9   0.257268  0.702273  0.529037  0.814035  0.269544
11  0.018802  0.736417  0.649349  0.514179  0.858137
16  0.248457  0.929227  0.738626  0.672995  0.886142
30  0.134174  0.610533  0.953266  0.590598  0.925234

In [104]:
newdf.drop([4],axis=0).head()

          0         1         2         3         4
0        54  0.133593  0.827758  0.332850  0.815619
1  0.223381  0.673758  0.708266  0.918993  0.229196
2  0.735779  0.986118  0.126935  0.685023  0.050855
3  0.331808  0.607073  0.507821  0.953118  0.656889
5  0.847509  0.331488  0.395940  0.600708  0.250094

In [105]:
newdf.drop([4],axis=1).head()

          0         1         2         3
0        54  0.133593  0.827758  0.332850
1  0.223381  0.673758  0.708266  0.918993
2  0.735779  0.986118  0.126935  0.685023
3  0.331808  0.607073  0.507821  0.953118
4   0.43367  0.947273  0.162297  0.420103

In [106]:
newdf

            0         1         2         3         4
0          54  0.133593  0.827758  0.332850  0.815619
1    0.223381  0.673758  0.708266  0.918993  0.229196
2    0.735779  0.986118  0.126935  0.685023  0.050855
3    0.331808  0.607073  0.507821  0.953118  0.656889
4     0.43367  0.947273  0.162297  0.420103  0.655472
..        ...       ...       ...       ...       ...
329  0.942466  0.445416  0.966202  0.295537  0.293268
330  0.387183  0.186650  0.753521  0.025815  0.721198
331  0.445693  0.522044  0.357614  0.175042  0.052485
332  0.134392  0.838215  0.538764  0.339175  0.296753
333  0.875011  0.898489  0.911705  0.943656  0.416888

[334 rows x 5 columns]

In [109]:
newdf.reset_index().head()

   index         0         1         2         3         4
0      0        54  0.133593  0.827758  0.332850  0.815619
1      1  0.223381  0.673758  0.708266  0.918993  0.229196
2      2  0.735779  0.986118  0.126935  0.685023  0.050855
3      3  0.331808  0.607073  0.507821  0.953118  0.656889
4      4   0.43367  0.947273  0.162297  0.420103  0.655472

In [113]:
newdf.reset_index(drop=True,inplace=True)

In [117]:
newdf.head(3)

   level_0  index         0         1         2         3         4
0        0      0        54  0.133593  0.827758  0.332850  0.815619
1        1      1  0.223381  0.673758  0.708266  0.918993  0.229196
2        2      2  0.735779  0.986118  0.126935  0.685023  0.050855

In [118]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [119]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [121]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25